tap "bramstein/webfonttools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
cask "xquartz"
brew "dockutil"
brew "ack"
brew "aircrack-ng"
brew "binutils"
brew "p7zip"
brew "xz"
brew "binwalk"
brew "cifer"
brew "coreutils"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "findutils"
brew "fish"
brew "foremost"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "gnu-sed", args: ["with-default-names"]
brew "gnupg"
brew "htop"
brew "ghc"
brew "cabal-install"
brew "go"
brew "grc"
brew "grep"
brew "hub"
brew "hashpump"
brew "hydra"
brew "imagemagick", args: ["with-webp"]
brew "john"
brew "jp2a"
brew "jq"
brew "knock"
brew "libcaca", args: ["with-imlib2"]
brew "libgit2"
brew "lua"
brew "lynx"
brew "mas"
brew "moreutils"
brew "netpbm"
brew "nmap"
brew "openssh"
brew "pigz"
brew "pngcheck"
brew "pv"
brew "rename"
brew "rlwrap"
brew "screen"
brew "socat"
brew "sqlmap"
brew "ssh-copy-id"
brew "stow"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "tree"
brew "ucspi-tcp"
brew "unrar"
brew "vbindiff"
brew "vim", args: ["with-override-system-vi"]
brew "wget"
brew "woff2"
brew "xpdf"
brew "youtube-dl"
brew "zopfli"
cask "discord"
cask "slack"
cask 'dash'
cask "expressvpn"
cask "firefox"
cask "gitup"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hyper"
cask "iterm2"
cask "slack"
cask "telegram"
cask "transmission"
cask 'skype'
cask 'charles'
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "vlc"
# mas "Todoist: Organize your life", id: 585829637
# mas "Toggl Desktop", id: 957734279

# web dev
brew "protobuf"

# mobile dev
cask "android-studio"
cask "android-sdk"
# mas "Xcode", id: 497799835

# devops
brew "awscli"
cask "google-cloud-sdk"
brew "packer"
brew "terraform"
brew "kubernetes-cli"
brew "kops"
brew "kubernetes-helm"
cask "docker"
cask "minikube"
cask "now"
tap "azure/draft"
brew "draft"

# Fonts
tap "caskroom/fonts"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
cask 'font-source-code-pro'
cask 'font-inconsolata'
